list-backend/app/controllers/items_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "items" ("name", "status", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Clean car"], ["status", "to_do"], ["list_id", 1], ["created_at", "2020-04-10 21:51:07.347654"], ["updated_at", "2020-04-10 21:51:07.347654"]]
---
    def create
        list = List.find_by(id: params[:list_id])
        item = list.items.create(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", "doing"], ["updated_at", "2020-04-16 17:57:46.743337"], ["id", 132]]
---
    def update
        item = Item.find_by(id: params[:id])
        item.update(item_params)

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 132], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 132]]
---
    def destroy
        item = Item.find_by(id: params[:id])
        item.delete