list-backend/app/controllers/lists_controller.rb

    def index
        lists = List.all
---
SELECT "lists".* FROM "lists"

    def create
        list = List.find_or_create_by(name: params[:name])
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Work"], ["created_at", "2020-04-13 00:44:04.468407"], ["updated_at", "2020-04-13 00:44:04.468407"]]
SELECT "lists".* FROM "lists" WHERE "lists"."name" = ? LIMIT ?  [["name", "Work"], ["LIMIT", 1]]

    def destroy
        listToDelete = List.find_by(id: params[:id])
        listToDelete.items.each { |item| item.delete }
        listToDelete.delete
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 91]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 12]]
SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 26]]
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 90]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 25]]